brew "stow"
brew "tmux"
brew "neovim"
brew "ripgrep"
brew "zoxide"
brew "fzf"
brew "git"
brew "gh"
brew "wget"
brew "thefuck"
brew "fnm"
brew "ollama"

brew "go"
brew "rustup-init"

brew "colima"

brew "docker"
brew "kubernetes-cli"
brew "k9s"

brew "platformio"
brew "avrdude"
brew "open-ocd"
brew "arduino-cli"

tap "homebrew/cask-versions"
cask "firefox-developer-edition"
cask "chromium"
cask "iterm2"
cask "wezterm"
cask "obsidian"
cask "rectangle"
cask "xcodes"
cask "android-studio"
cask "tailscale"
cask "protonvpn"
cask "proton-drive"
cask "keybase"

cask "spotify"
cask "github"
cask "signal"
cask "slack"
cask "element"
cask "zoom"

cask "visual-studio-code"
vscode "golang.go"
vscode "rust-lang.rust-analyzer"
vscode "vadimcn.vscode-lldb"
vscode "sswg.swift-lang"
vscode "msjsdiag.vscode-react-native"
vscode "ms-vscode.cpptools"
vscode "platformio.platformio-ide"
vscode "github.github-vscode-theme"
vscode "github.copilot"
vscode "editorconfig.editorconfig"
vscode "bierner.markdown-mermaid"
vscode "vscode-icons-team.vscode-icons"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "bbenoist.nix"
vscode "yoavbls.pretty-ts-errors"
vscode "quick-lint.quick-lint-js"
vscode "mikestead.dotenv"
vscode "johnpapa.vscode-cloak"

brew "mas" if OS.mac?
mas "Bitwarden", id: 135_277_8147 if OS.mac?
mas "Meshtastic", id: 158_643_2531 if OS.mac?
